# Parameter Type Id View Position Y Property

Source: https://www.revitapidocs.com/2026/c17405a7-acfb-50f7-3e6f-ffd7e6e0dc9e.htm

---

| Parameter Type Id View Position Y Property |
| --- |

"View Position Y"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ViewPositionY { get; }
```

```
Public Shared ReadOnly Property ViewPositionY As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ViewPositionY {
	ForgeTypeId^ get ();
}
```

```
static member ViewPositionY : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace